Revit 2027 API
CriticalPathCollector Constructor
 Creates a new CriticalPathCollector that visits the analytical segments on the network critical path.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CriticalPathCollector(
	Document doc,
	MEPNetworkSegmentId segmentId
)
Public Sub New (
	doc As Document,
	segmentId As MEPNetworkSegmentId
)
public:
CriticalPathCollector(
	Document^ doc,
	MEPNetworkSegmentId^ segmentId
)
new :
        doc : Document *
        segmentId : MEPNetworkSegmentId -> CriticalPathCollector
Parameters
doc Document
 The document of the analytical network.
segmentId MEPNetworkSegmentId
 The analytical segment to identify the network. Note that this segment is not required to be on the critical path.
Exceptions
Exception | Condition
ArgumentException |  The network segment id is invalid.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
CriticalPathCollector Class
Autodesk.Revit.DB.Analysis Namespace